/**
 ***********************************************************************************************************************
 * @file    app_dev.h
 * @brief   系统运行状态、故障状态及系统任务接口定义
 * @author  Su Jiawei
 * @version 1.0.0
 * @date    2025-09-03
 ***********************************************************************************************************************
 * @copyright Copyright (c) 1999-2025 ShenZhen H&T Control Technology Co., Ltd. All rights reserved.
 ***********************************************************************************************************************
 */

#ifndef _APP_DEV_H_
#define _APP_DEV_H_

#include "main.h"


typedef struct 
{
    uint8_t         fan_dev;
    uint8_t         fan_dir;
    bool            mist_dev;
    bool            power;
    bool            lastpower;
}app_dev_t;

/* Typedef -----------------------------------------------------------------------------------------------------------*/
/*******************************************************************************
//  Function   : button_all_passCallback
//  Description: 按键按下确定回调
//  Param      : None
//  Return     : None
//  Others     : 依次处理电源、连续工作保护、开机动画、按键事件及输出刷新
//  Author     : 陈亮 2026-06-06
*******************************************************************************/
void add_dev_1ms_task(void);

#endif

