/**
 ***********************************************************************************************************************
 * @file    bms_status.h
 * @brief   BMS 状态识别接口，实现 IP5326 1/2/4 灯模式下的 LED 状态及充放电状态识别
 * @author  Leo Chen
 * @version 1.0.0
 * @date    2026-10-14
 ***********************************************************************************************************************
 * @copyright Copyright (c) 1999-2025 ShenZhen H&T Control Technology Co., Ltd. All rights reserved.
 ***********************************************************************************************************************
 */

#ifndef _BMS_APP_H_
#define _BMS_APP_H_

#include "bms_config.h"



#endif /* _BMS_STATUS_H_ */
